Revit 2026 API

# ContentNodeGetAsset Method

---

Returns an an instance of an Asset object, which contains definitions of the content node.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Asset GetAsset()
```
```vb
Public Function GetAsset As Asset
```
```cpp
public:
Asset^ GetAsset()
```
```fsharp
member GetAsset : unit -> Asset
```

#### Return Value

Asset

Properties and attributes of the node can be accessed using the standard interface of the Asset class.

#### Reference

ContentNode Class

Autodesk.Revit.DB Namespace